# Задача 1.1 - кучки бумажек (можно или нет)




# Задача 1.2 - Кучки бумажек (число ходов)





# Задача 2 - Можно ли замостить доминошками фигуру





# Задача 3 - сумма цифр на километровых столбах
import numpy as np
n = 123
print(all(map(lambda x: sum(x)==n,zip(range(n+1),range(n,-1,-1)))))

# Задача 4.1 - пятнашки (чётность перестановки)






# Задача 4.2 - пятнашки (возможность выигрыша из текущей позиции)






# Задача 4.3 - пятнашки (на поле произвольного размера)

































